# Full developer Mac package manifest. Homebrew installs only missing entries.

brew "aider"
brew "bat"
brew "btop"
brew "cmake"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "jq"
brew "mise"
brew "ollama"
brew "opencode"
brew "portaudio"
brew "shellcheck"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "uv"
brew "yq"
brew "zoxide"

# Stable Gemini CLI is distributed through the official Homebrew formula.
brew "gemini-cli"

cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "bruno"
cask "cursor"
cask "dbngin"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "hiddenbar"
cask "lm-studio"
cask "mos"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "whatsapp"

uv "pre-commit"
uv "ruff"
