# Shell and verification dependencies for this dotfiles repository.
# Installing these packages is an explicit provisioning action, not part of install.sh.

brew "bat"
brew "btop"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "gitleaks"
brew "jq"
brew "mise"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "zoxide"

cask "1password-cli"
cask "cursor"
cask "ghostty"
